#### **파이썬**

In [15]:
#여러 숫자 불러오기
def cal(*n):
    summ=sum(n)
    avg=sum(n)/len(n)
    return summ,avg

In [17]:
cal(1,3,6,8,10)

(28, 5.6)

#### **라이브러리 불러오기**

In [22]:
import numpy as np

In [ ]:
a3 = [[[1, 3, 1],
       [4, 7, 6],
       [8, 3, 4]],
      [[6, 2, 4],
       [8, 1, 5],
       [3, 5, 9]]]

#배열로 변환
b3=np.array(a3)

In [32]:
#형태 크기 확인
print(b3.shape)

(2, 3, 3)

In [34]:
#전체중에서 가장 큰 값의 인덱스
print(np.argmax(a3))

17

In [38]:
#행 방향 최대값의 인덱스
print(np.argmax(a3,axis=0))

[[1 0 1]
 [1 0 0]
 [0 1 1]]

In [44]:
#np.where(조건문, 참일때 값, 거짓일때 값)
np.where(b3>2,1,0) #값이 2보다 클때 1 작으면 0

array([[[0, 1, 0],
        [1, 1, 1],
        [1, 1, 1]],

       [[1, 0, 1],
        [1, 0, 1],
        [1, 1, 1]]])

#### **데이터 불러오기**

In [6]:
import pandas as pd

path='https://raw.githubusercontent.com/DA4BAM/dataset/master/titanic_simple.csv'
data=pd.read_csv(path)

#상위 10개만 확인
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,Southampton
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,Cherbourg
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,Southampton
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,Southampton
4,5,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,Southampton

In [7]:
#하위 데이터 3개 확인
data.tail(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,23.45,Southampton
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,30.00,Cherbourg
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,7.75,Queenstown

In [8]:
#컬럼 이름 확인
list(data)

['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'Fare', 'Embarked']

In [9]:
#열의 자료형, 값 개수 확인
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   Fare         891 non-null    float64
 7   Embarked     889 non-null    object
dtypes: float64(2), int64(3), object(3)
memory usage: 55.8+ KB

In [14]:
#Sex 성별의 고유값과 개수 확인
print(data['Sex'].unique())
print(data['Sex'].value_counts())

['male' 'female']
Sex
male      577
female    314
Name: count, dtype: int64

#### **데이터 조회**

In [17]:
# and 연산자로 여러 조건 연결-성별이 여자이면서 나이가 20대 이하인 사람 조회
data.loc[(data['Sex']=='female')&(data['Age']<20)]

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Embarked
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,30.0708,Cherbourg
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,16.7000,Southampton
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,7.8542,Southampton
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,8.0292,Queenstown
24,25,0,3,"Palsson, Miss. Torborg Danira",female,8.0,21.0750,Southampton
...,...,...,...,...,...,...,...,...
852,853,0,3,"Boulos, Miss. Nourelain",female,9.0,15.2458,Cherbourg
853,854,1,1,"Lines, Miss. Mary Conover",female,16.0,39.4000,Southampton
855,856,1,3,"Aks, Mrs. Sam (Leah Rosen)",female,18.0,9.3500,Southampton
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,7.2250,Cherbourg
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,30.0000,Southampton

In [19]:
#isin(값1,값2....): 값1,값2인 데이터만 조회,무조건 리스트형태로 조회
#값 나열, 나이가 10살과 20살만 조회
data.loc[data['Age'].isin([10,20])]

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Embarked
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,8.0500,Southampton
91,92,0,3,"Andreasson, Mr. Paul Edvin",male,20.0,7.8542,Southampton
113,114,0,3,"Jussila, Miss. Katriina",female,20.0,9.8250,Southampton
131,132,0,3,"Coelho, Mr. Domingos Fernandeo",male,20.0,7.0500,Southampton
378,379,0,3,"Betros, Mr. Tannous",male,20.0,4.0125,Cherbourg
404,405,0,3,"Oreskovic, Miss. Marija",female,20.0,8.6625,Southampton
419,420,0,3,"Van Impe, Miss. Catharina",female,10.0,24.1500,Southampton
441,442,0,3,"Hampe, Mr. Leon",male,20.0,9.5000,Southampton
622,623,1,3,"Nakid, Mr. Sahid",male,20.0,15.7417,Cherbourg
640,641,0,3,"Jensen, Mr. Hans Peder",male,20.0,7.8542,Southampton
664,665,1,3,"Lindqvist, Mr. Eino William",male,20.0,7.9250,Southampton
682,683,0,3,"Olsvigen, Mr. Thor Anderson",male,20.0,9.2250,Southampton
725,726,0,3,"Oreskovic, Mr. Luka",male,20.0,8.6625,Southampton
762,763,1,3,"Barah, Mr. Hanna Assi",male,20.0,7.2292,Cherbourg
819,820,0,3,"Skoog, Master. Karl Thorsten",male,10.0,27.9000,Southampton
840,841,0,3,"Alhomaki, Mr. Ilmari Rudolf",male,20.0,7.9250,Southampton
876,877,0,3,"Gustafsson, Mr. Alfred Ossian",male,20.0,9.8458,Southampton

In [21]:
#between(값1,값2): 값1~값2인 데이터 조회, 기본 <=,>=
#inclusive='left','right','both'
#나이가 10~19 사이의 사람 다 조회
data.loc[data['Age'].between(10,20,inclusive='left')]

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Embarked
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,30.0708,Cherbourg
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,7.8542,Southampton
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,8.0292,Queenstown
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,263.0000,Southampton
38,39,0,3,"Vander Planke, Miss. Augusta Maria",female,18.0,18.0000,Southampton
...,...,...,...,...,...,...,...,...
853,854,1,1,"Lines, Miss. Mary Conover",female,16.0,39.4000,Southampton
855,856,1,3,"Aks, Mrs. Sam (Leah Rosen)",female,18.0,9.3500,Southampton
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,7.2250,Cherbourg
877,878,0,3,"Petroff, Mr. Nedelio",male,19.0,7.8958,Southampton
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,30.0000,Southampton

#### **데이터 프레임 변경**

In [24]:
data2=data.copy()

In [26]:
data2.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,Southampton
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,Cherbourg
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,Southampton
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,Southampton
4,5,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,Southampton

In [36]:
#rename()함수로 컬럼 이름 변경하기
data2.rename(columns={'PassengerId':'ID',
            'Survived':'safe',
            'Pclass':'floor',
            'Name':'Name',
            'Sex':'Sex',
            'Age':'Age',
            'Fare':'Fee',
            'Embarked':'Hometown'}, inplace=True)

data2.head()

,ID,safe,floor,Name,Sex,Age,Fee,Hometown
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,Southampton
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,Cherbourg
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,Southampton
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,Southampton
4,5,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,Southampton

##### **1) map()메소드**

- 주로 범주형 값을 다른 값으로 변경
- 다음 구문은 Gen 변수의 Male, Female을 각각 숫자 1, 0으로 변경합니다.

In [47]:
#Sex에서 male->1, female->0
data2['Gen']=data['Sex'].map({'male':1,'female':0})

data2.head()

,ID,safe,floor,Name,Sex,Age,Fee,Hometown,Gen
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,Southampton,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,Cherbourg,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,Southampton,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,Southampton,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,Southampton,1

#### **데이터 프레임 결합**

결합: 붙이기 concat()

In [55]:
data2.head()

,ID,safe,floor,Name,Sex,Age,Fee,Hometown,Gen
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,Southampton,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,Cherbourg,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,Southampton,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,Southampton,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,Southampton,1

In [71]:
#concat은 dataframe이나 series형태만 가능하다. 그러므로 series로 변경 후 병합
Name_series=data2['Name']
Sex_series=data2['Sex']

In [75]:
#타입 확인
print(type(Sex_series))
print(Sex_series.head())

<class 'pandas.core.series.Series'>
0      male
1    female
2    female
3    female
4      male
Name: Sex, dtype: object

In [79]:
#합치기 그냥 위아래로 병합
temp=pd.concat([Name_series,Sex_series])
temp

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                                 male
887                                               female
888                                               female
889                                                 male
890                                                 male
Length: 1782, dtype: object

조인 join(merge)

#### **시계열 데이터 처리**

In [99]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [106]:
sales = pd.read_csv("https://raw.githubusercontent.com/DA4BAM/dataset/master/ts_sales_simple.csv")
products = pd.read_csv("https://raw.githubusercontent.com/DA4BAM/dataset/master/ts_product_master.csv")

In [109]:
# 판매액 계산하기
temp = pd.merge(sales, products)
temp['Amt' ] = temp['Qty'] * temp['Price']
temp['Amt'] = (temp['Amt']/1000).round()  # 단위 1000달러

# 집계
data1 = temp.groupby(['Date', 'Category'], as_index = False)['Amt'].sum()
data2 = temp.groupby(['Date'], as_index = False)['Amt'].sum()

# 피봇
data11 = data1.pivot(index = 'Date', columns = 'Category', values = 'Amt').reset_index()

# 합치기
data = pd.merge(data2, data11)

In [112]:
data.head()

         Date     Amt  Drink   Food  Grocery  Household Goods
0  2013-01-01    20.0    7.0    4.0      6.0              3.0
1  2013-01-02  3938.0  604.0  549.0   1663.0           1122.0
2  2013-01-03  2885.0  444.0  376.0   1222.0            843.0
3  2013-01-04  2907.0  490.0  386.0   1252.0            779.0
4  2013-01-05  3831.0  704.0  505.0   1560.0           1062.0

##### 1) 날짜 타입으로 변환
* pd.to_datetime(날짜데이터, format = '입력되는 날짜 형식')

In [120]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31 entries, 0 to 30
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Date             31 non-null     object
 1   Amt              31 non-null     float64
 2   Drink            31 non-null     float64
 3   Food             31 non-null     float64
 4   Grocery          31 non-null     float64
 5   Household Goods  31 non-null     float64
dtypes: float64(5), object(1)
memory usage: 1.6+ KB

In [124]:
data['Date']=pd.to_datetime(data['Date'])
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31 entries, 0 to 30
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Date             31 non-null     datetime64[ns]
 1   Amt              31 non-null     float64
 2   Drink            31 non-null     float64
 3   Food             31 non-null     float64
 4   Grocery          31 non-null     float64
 5   Household Goods  31 non-null     float64
dtypes: datetime64[ns](1), float64(5)
memory usage: 1.6 KB

In [130]:
date = pd.Series(['03-01-2023', '03-02-2023', '03-03-2023'])
date = pd.to_datetime(date)
date

0   2023-03-01
1   2023-03-02
2   2023-03-03
dtype: datetime64[ns]

##### 2) 날짜 요소 추출

In [132]:
#연도
date.dt.year #month,day,weekday...

0    2023
1    2023
2    2023
dtype: int32

##### 3) shift
* 시계열 데이터에서 시간의 흐름 전후로 정보를 이동시킬 때 사용

In [139]:
temp = data.loc[:,['Date','Amt']]

In [144]:
# 전날 매출액 열을 추가합시다.
temp['Amt_lag'] = temp['Amt'].shift() #default = 1

# 전전날 매출액 열을 추가.
temp['Amt_lag2'] = temp['Amt'].shift(2) # 2행 shift

# 다음날 매출액 열을 추가합시다.
temp['Amt_lag_1'] = temp['Amt'].shift(-1)

temp.head()

        Date     Amt  Amt_lag  Amt_lag2  Amt_lag_1
0 2013-01-01    20.0      NaN       NaN     3938.0
1 2013-01-02  3938.0     20.0       NaN     2885.0
2 2013-01-03  2885.0   3938.0      20.0     2907.0
3 2013-01-04  2907.0   2885.0    3938.0     3831.0
4 2013-01-05  3831.0   2907.0    2885.0     4066.0

#### **단변량분석_숫자형변수**

숫자형 변수
* 기초통계량: min,max,mean,std,사분위수 
* 시각화: Histogram,Density plot,Box plot

In [168]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
import seaborn as sns

In [173]:
path = 'https://raw.githubusercontent.com/DA4BAM/dataset/master/titanic_simple.csv'
titanic = pd.read_csv(path)
titanic.tail(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Embarked
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,30.00,Cherbourg
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,7.75,Queenstown

In [180]:
# 평균: 타이타닉 운임요금 평균
np.mean(titanic['Fare'])

32.204207968574636

In [185]:
# 중앙값(median)
np.median(titanic['Fare'])

14.4542

In [188]:
#최빈값 : 자료중에서 가장 빈번하게 나타나는 값
titanic['Pclass'].mode()

0    3
Name: Pclass, dtype: int64

In [191]:
titanic['Fare'].describe()

count    891.000000
mean      32.204208
std       49.693429
min        0.000000
25%        7.910400
50%       14.454200
75%       31.000000
max      512.329200
Name: Fare, dtype: float64

#### **단변량분석_범주형변수**

범주형 변수
* 기초통계량: 범주 별 빈도수, 범주 별 비율
* 시각화: Bar plot, Pie chart